lab7_php_ci/ci4/app/Controllers/User.php

    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        // Cari user berdasarkan username
        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'user'
 LIMIT 1

    public function registerProcess()
    {
        $model = new UserModel();

        $data = [
            'username' => $this->request->getVar('username'),
            // Mengenkripsi password sebelum disimpan ke DB
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'role' => 'user'
        ];

        $model->save($data);
---
INSERT INTO `user` (`username`, `password`, `role`) VALUES ('rizky', '$2y$10$gEhHRl3lILD4FrK20DB6wuB.UYyEanDXinlNtkDFpa/K6qcij74yS', 'user')